Revit 2026 API

# ViewCropBoxActive Property

---

Whether or not the Crop Box/Region is active for the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CropBoxActive { get; set; }
```
```vb
Public Property CropBoxActive As Boolean
	Get
	Set
```
```cpp
public:
property bool CropBoxActive {
	bool get ();
	void set (bool value);
}
```
```fsharp
member CropBoxActive : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InapplicableDataException | Thrown when getting this property, if the view is a template and cannot have a crop box applied. |
| InvalidOperationException | Thrown when setting this property, if the view is a template and cannot have a crop box applied. |

Identifies whether the crop region modifies the graphical appearance of elements in the view.

#### Reference

View Class

Autodesk.Revit.DB Namespace